# Introduction to Pandas Dataframes

#### Dataframes is the datastructure used to represent the data in tabular form

In [1]:
import pandas as pd
df=pd.read_csv('bollywood.csv')
df.head(5)

,SlNo,Release Date,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes
0,1,18-Apr-14,2 States,LW,Romance,36,104.00,8576361,26622,2527
1,2,4-Jan-13,Table No. 21,N,Thriller,10,12.00,1087320,1129,137
2,3,18-Jul-14,Amit Sahni Ki List,N,Comedy,10,4.00,572336,586,54
3,4,4-Jan-13,Rajdhani Express,N,Drama,7,0.35,42626,86,19
4,5,4-Jul-14,Bobby Jasoos,N,Comedy,18,10.80,3113427,4512,1224

### Another method of creating data frames

In [4]:
weather_data=[('1/1/2017', 32, 6,'Rain'),
              ('1/2/2017', 35, 7,'Sunny'),
              ('1/3/2017', 28, 2,'Snow'),
              ('1/4/2017', 24, 7,'Snow'),
              ('1/5/2017', 32, 4,'Rain'),
              ('1/6/2017', 31, 2,'Sunny')]
df=pd.DataFrame(weather_data,columns=['date','temperature','windspeed','weather'])
df

       date  temperature  windspeed weather
0  1/1/2017           32          6    Rain
1  1/2/2017           35          7   Sunny
2  1/3/2017           28          2    Snow
3  1/4/2017           24          7    Snow
4  1/5/2017           32          4    Rain
5  1/6/2017           31          2   Sunny

In [5]:
#get dimension
df.shape

(6, 4)

In [6]:
#to get some initial data
df.head(5)

       date  temperature  windspeed weather
0  1/1/2017           32          6    Rain
1  1/2/2017           35          7   Sunny
2  1/3/2017           28          2    Snow
3  1/4/2017           24          7    Snow
4  1/5/2017           32          4    Rain

In [7]:
#to get last data
df.tail(5)

       date  temperature  windspeed weather
1  1/2/2017           35          7   Sunny
2  1/3/2017           28          2    Snow
3  1/4/2017           24          7    Snow
4  1/5/2017           32          4    Rain
5  1/6/2017           31          2   Sunny

In [8]:
#slicing
df[2:5]

       date  temperature  windspeed weather
2  1/3/2017           28          2    Snow
3  1/4/2017           24          7    Snow
4  1/5/2017           32          4    Rain

In [9]:
df.columns

Index(['date', 'temperature', 'windspeed', 'weather'], dtype='object')

In [10]:
df.date
#data from one columns

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: date, dtype: object

In [11]:
 df['date']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: date, dtype: object

In [12]:
#data from 2 columns
df[['date','temperature']]

       date  temperature
0  1/1/2017           32
1  1/2/2017           35
2  1/3/2017           28
3  1/4/2017           24
4  1/5/2017           32
5  1/6/2017           31

In [13]:
#print max temp
df['temperature'].max()

35

In [14]:
df['temperature'].min()

24

In [16]:
# gets all data
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [20]:
#select the row with max temp
df[df.temperature==df.temperature.max()]

       date  temperature  windspeed weather
1  1/2/2017           35          7   Sunny

In [23]:
#select only day column with max temp
df.date[df.temperature==df.temperature.max()]

1    1/2/2017
Name: date, dtype: object